/*
  小玉看到上面写：据闽价电 [2006]27 号规定，月用电量在
150
150 千瓦时及以下部分按每千瓦时
0.4463
0.4463 元执行，月用电量在
151
∼
400
151∼400 千瓦时的部分按每千瓦时
0.4663
0.4663 元执行，月用电量在
401
401 千瓦时及以上部分按每千瓦时
0.5663
0.5663 元执行;*/
#include <iostream>
using namespace std;
double ans;
int main() {
  int a;
  cin >> a;
  if (a <= 150) {
    ans += a * 0.4463;
  } else if (a > 150 && a <= 400) {
    ans += 150 * 0.4463 + (a - 150) * 0.4663;
  } else {
    ans += 150 * 0.4463 + 250 * 0.4663 + (a - 400) * 0.5663;
  }
  printf("%.1lf", ans);
  return 0;
}
